of_cases/damBreak2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.146;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 4 0)
    (0 4 0)
    (0 0 1)
    (4 0 1)
    (4 4 1)
    (0 4 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    backWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    frontWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
