of_cases/damBreak2/0.orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16000
(
(0.0073 0.0073 0.0073)
(0.0219 0.0073 0.0073)
(0.0365 0.0073 0.0073)
(0.0511 0.0073 0.0073)
(0.0657 0.0073 0.0073)
(0.0803 0.0073 0.0073)
(0.0949 0.0073 0.0073)
(0.1095 0.0073 0.0073)
...
)
;

boundaryField
{
    backWall
    {
        type            calculated;
        value           nonuniform List<vector> 
1600
(
(0.0073 0.0073 0.146)
(0.0073 0.0219 0.146)
(0.0073 0.0365 0.146)
(0.0073 0.0511 0.146)
(0.0073 0.0657 0.146)
(0.0073 0.0803 0.146)
(0.0073 0.0949 0.146)
(0.0073 0.1095 0.146)
...
)
;
    }
    frontWall
    {
        type            calculated;
        value           nonuniform List<vector> 
1600
(
(0.0073 0.0073 0)
(0.0073 0.0219 0)
(0.0073 0.0365 0)
(0.0073 0.0511 0)
(0.0073 0.0657 0)
(0.0073 0.0803 0)
(0.0073 0.0949 0)
(0.0073 0.1095 0)
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0 0.0073 0.0073)
(0 0.0219 0.0073)
(0 0.0365 0.0073)
(0 0.0511 0.0073)
(0 0.0657 0.0073)
(0 0.0803 0.0073)
(0 0.0949 0.0073)
(0 0.1095 0.0073)
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.584 0.0073 0.0073)
(0.584 0.0219 0.0073)
(0.584 0.0365 0.0073)
(0.584 0.0511 0.0073)
(0.584 0.0657 0.0073)
(0.584 0.0803 0.0073)
(0.584 0.0949 0.0073)
(0.584 0.1095 0.0073)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.0073 0 0.0073)
(0.0073 0 0.0219)
(0.0073 0 0.0365)
(0.0073 0 0.0511)
(0.0073 0 0.0657)
(0.0073 0 0.0803)
(0.0073 0 0.0949)
(0.0073 0 0.1095)
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.0073 0.584 0.0073)
(0.0073 0.584 0.0219)
(0.0073 0.584 0.0365)
(0.0073 0.584 0.0511)
(0.0073 0.584 0.0657)
(0.0073 0.584 0.0803)
(0.0073 0.584 0.0949)
(0.0073 0.584 0.1095)
...
)
;
    }
}


// ************************************************************************* //
