of_cases/damBreak2/0.orig/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16000
(
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
...
)
;

boundaryField
{
    backWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
0.0073
0.0219
0.0365
0.0511
0.0657
0.0803
0.0949
0.1095
...
)
;
    }
    frontWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
0.0073
0.0219
0.0365
0.0511
0.0657
0.0803
0.0949
0.1095
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.0073
0.0219
0.0365
0.0511
0.0657
0.0803
0.0949
0.1095
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.0073
0.0219
0.0365
0.0511
0.0657
0.0803
0.0949
0.1095
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.584
0.584
0.584
0.584
0.584
0.584
0.584
0.584
...
)
;
    }
}


// ************************************************************************* //
