of_cases/damBreak2/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

#runApplication setFields
#runApplication postProcess -func writeCellCentres -time 0

runApplication $(getApplication)

#------------------------------------------------------------------------------
